import React from "react";
import "../components/about/About.css";
import { useSelector } from "react-redux";

const About = () => {
  const isDark = useSelector((s) => s.theme.isDark);
  return (
    <div className="about-height container">
      <div className="about-header">
        <h1> אפליקציית חדשות</h1>
        <h3>פרויקט React + Redux במסגרת הלימודים במכללת האקריו</h3>
        <h4>מאת: לוריין שרוני</h4>
        <hr />
      </div>
      <div className="about-content">
        <div
          className={` ${isDark ? "sub-content dark" : "sub-content light"} `}
        >
          <h4>מקור התוכן:</h4>
          <p>
            האפליקציה מציגה כתבות מתוך כתובת api חיצונית:
            <a href="http://newsapi.org"> http://newsapi.org</a> .
          </p>
        </div>
        <div
          className={` ${isDark ? "sub-content dark" : "sub-content light"} `}
        >
          <h4>דרישות טכנולוגיות:</h4>
          <p>האתר משתמש בטכנולוגיות הבאות: HTML, CSS, JS, REACT, REDUX.</p>
          <p>עיצוב האתר נעשה ע"י שימוש ב Flex.</p>
          <p>האתר ריספונסיבי.</p>
        </div>
        <div
          className={` ${isDark ? "sub-content dark" : "sub-content light"} `}
        >
          <h4> תוכן האתר:</h4>
          <p>
            הכתבות מוצגות באתר באופן הבא: עמוד הבית מכיל כתבות מכל הקטגוריות וה
            Drop Down בסרגל הניווט מציג כתבות לפי קטגרויות מסויימות, לדוגמה:
            כתבות בנושא ספורט.
          </p>
          <p>עמוד Favorites: מכיל את הכתבות שהמשתמש סימן ככתבות מועדפות.</p>
          <p>עמוד About: מכיל הסבר על הפרויקט.</p>
          <p>אייקון השמש בסרגל הניווט: משנה את צבע האתר. זהו ה Dark Mode.</p>
          <p>אייקון החיצים בסרגל הניווט: ממיין את הכתבות לפי תאריך.</p>
          <p>מנוע החיפוש בסרגל הכלים: מחפש מבין כל כותרות החדשות.</p>
          <p>בתחתית האתר: יש קישור לאפליקציות כגון פייסבוק, גיטהאב ועוד.</p>
        </div>
        <div
          className={` ${isDark ? "sub-content dark" : "sub-content light"} `}
        >
          <h4>חוויית המשתמש:</h4>
          <p>
            האפליקציה מאפשרת למשתמש להוסיף כתבה למועדפים ע"י סימון אייקון הלב
            בכל כתבה. בנוסף, ניתן להסיר כתבה ע"י ביטול הסימון.
          </p>
          <p>ניתן למחוק כתבה ע"י לחיצה על אייקון המחיקה.</p>
          <p>
            ניתן להוסיף תגובה לכל כתבה ע"י לחיצה על אייקון התגובות והוספת תגובה
            בדף התגובות. כמו כן, ניתן לערוך תגובות.
          </p>
          <p>
            האפליקציה מאפשרת למשתמש להיכנס לתוכן של כל כתבה ע"י לחיצה על כפתור
            Read The Article. בתוך הכתבה עצמה, קיים תוכן נוסף וקישור המפנה את
            המשתמש למקור הכתבה. בנוסף, קיים כפתור המחזיר את המשתמש עמוד אחורה.
          </p>
          <p>
            המשתמש יכול לראות בעמוד הבית כתבות מכל הקטגוריות ויכול לבחור קטגוריה
            ספציפית בסרגל הניווט.
          </p>
          <p>לחיצה על לוגו האתר מפנה את המשתמש לעמוד הבית.</p>
          <p>
            במידה והכתבה הגיעה מה api ללא תמונה או ללא תוכן, קיימת תמונת ברירת
            מחדל ובתוכן יהיה כתוב "No Description".
          </p>
          <p>
            בזמן הטעינה לאחר מעבר בין העמודים, המתשמש יראה שלוש נקודות ירוקות
            המייצגות את טעינת העמוד.
          </p>
          <p>במידה והעמוד לא קיים, המשתמש יופנה לעמוד שגיאה 404.</p>
        </div>
        <div
          className={` ${isDark ? "sub-content dark" : "sub-content light"} `}
        >
          <h4>סיכום מענה על דרישות הפרויקט:</h4>
          <p>
            בדף הבית רואים את כל הכרטיסיות ובלחיצה על כפתור News Detailes צוללים
            לתוך הפרטים בכרטיסיה ספציפית.
          </p>
          <p>ניתן למחוק כרטיסיה מהדף הראשי.</p>
          <p>ניתן להוסיף תגובה.</p>
          <p>ניתן לערוך תגובה.</p>
          <p>באתר יש 13 דפים מנותבים.</p>
          <p>דף About הוא דף מידע כללי על האתר.</p>
          <p>ניתן לסמן כתבה/ות כמועדפת/ות ולצפות בה/בהן בעמוד המועדפים. </p>
          <p>
            ניתן לסנן כתבות לפי תאריך ולפי מלל חופשי (כל זה נמצא בסרגל ניווט
            עליון).
          </p>
          <p>האתר מכיל Dark Mode.</p>
          <p>
            האפליקציה מציגה כתבות מתוך כתובת api חיצונית:
            <a href="http://newsapi.org"> http://newsapi.org</a> .
          </p>
          <p>האתר משתמש בטכנולוגיות הבאות: HTML, CSS, JS, REACT, REDUX.</p>
          <p>עיצוב האתר נעשה ע"י שימוש ב Flex.</p>
          <p>האתר ריספונסיבי.</p>
        </div>
      </div>
    </div>
  );
};

export default About;
